A = [3 -7 7 2; 1 -8 10 3; 4 -7 14 5; 1 2 -3 -1];
B = [-22; -35; -48; 12];
AB = [A B];
rank(A);
rank(AB);
#Метод Гаусса с Полным выбором
AB = AB([3, 2, 1, 4], [3, 2, 4, 1, 5])

#1
AB1 = [AB(1, :);...
AB(2, :) - AB(1, :) .*AB(2, 1)/AB(1,1);...
AB(3, :) - AB(1, :) .*AB(3, 1)/AB(1,1);...
AB(4, :) - AB(1, :) .*AB(4, 1)/AB(1,1)]

#2
AB = AB1([1, 3, 2, 4], [1, 2, 4, 3, 5])
AB2 = [AB(1, :); AB(2, :);...
AB(3, :) - AB(2, :) .*AB(3, 2)/AB(2,2);...
AB(4, :) - AB(2, :) .*AB(4, 2)/AB(2,2)]

#3
AB = AB2([1, 2, 4, 3], :)
AB3 = [AB(1, :); AB(2, :); AB(3, :); AB(4, :) - AB(3, :) .*AB(4, 3)/AB(3,3)]

x4 = AB3(4, end) / AB3(4, end - 1);
x3 = (AB3(3, end) - x4*AB3(3, end - 1)) / AB3(3, end - 2);
x2 = (AB3(2, end) - x3*AB3(2, end - 2) - x4*AB3(2, end - 1)) / AB3(2, end - 3);
x1 = (AB3(1, end) - x3*AB3(1, end - 2) - x4*AB3(1, end - 1) - x2*AB3(1, end - 3)) / AB3(1, end - 4);

X = [x3;x2;x1;x4]

A\B
