A = [3 -7 7 2; 1 -8 9 2;4 -2 3 1; 5 -17 1 -2]
B = [8; 3; 17; -24]
AB = [A B]
rank(A)
rank(AB)
AB([4, 2, 3, 1], :) # Поменяли строки местами
AB1 = [AB(1,:); AB(2,:) - AB(1,:) * AB(2,1)/AB(1,1);...
AB(3,:) - AB(1,:) * AB(3, 1)/AB(1,1);
AB(4,:) - AB(1,:) * AB(4, 1)/AB(1,1);]

AB2 = AB1([1, 3, 2, 4], :)
AB3 = [AB2([1, 2], :);
AB2(3,:) - AB2(2, :) * AB2(3, 2)/AB2(2, 2);
AB2(4,:) - AB2(2, :) * AB2(4, 2)/AB2(2, 2)]
AB4 = [AB3([1:2], :);
AB3(4, :);
AB3(3,:)]

AB5 = [AB4(1:3, :);
AB4(4,:) - AB4(3,:) * AB4(4,3)/AB4(3, 3)]

x4 = AB5(4, end)/AB5(4, end - 1) # Обратный ход
x3 = (AB5(3, end) - x4*AB5(3, end - 1)) / AB5(3, end-2)
x2 = (AB5(2, end) - x3*AB5(2, end - 2) - x4*AB5(2, end - 1)) / AB5(2, end - 3)
x1 = (AB5(1, end) - x3*AB5(1, end - 2) - x4*AB5(1, end - 1) - x2*AB5(1, end - 3)) / AB5(1, end - 4)

X = [x1 x2 x3 x4]'
A\B

[A * X B]
